title: AMSI Disable via Reflection
id: 20a3a3a3-3333-4444-5555-666666666666
status: stable
description: PowerShell AMSI bypass using reflection
author: Christopher Bradford
tags:
  - attack.defense-evasion
  - attack.t1562.001
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    ScriptBlockText|contains|all:
      - '[Ref].Assembly.GetType'
      - 'System.Management.Automation.AmsiUtils'
      - 'fieldValue'
  condition: selection
level: high
