title: Azure Service Principal New Secret Added
id: 25f8f8f8-8888-9999-aaaa-bbbbbbbbbbbb
tags:
  - attack.persistence
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    OperationName: 'Add service principal credentials'
  condition: selection
level: high
