title: Azure AD Impossible Travel
id: 1c2b00f0-243f-46bc-85f3-8f9369bf7bea
status: stable
description: Successful login from two locations >2000km apart in <1h
author: Christopher Bradford
date: 2025-11-23
tags:
  - attack.initial-access
  - attack.t1078.004
logsource:
  product: azure
  service: signinlogs
detection:
  selection:
    ResultType: 0
    Location: '*'
  condition: selection
falsepositives:
  - VPN, travel, proxy
level: high