title: Azure App Registration New Client Secret
id: 22c5c5c5-5555-6666-7777-888888888888
tags:
  - attack.persistence
  - attack.t1098.001
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    OperationName: 'Update application - Certificates and secrets management'
  condition: selection
level: high
