title: Linux Suspicious Download to /tmp or /dev/shm
id: 831af6ec-e503-4751-9baf-b24504fc1fa3
status: stable
description: curl/wget writing directly to temporary locations
author: Christopher Bradford
date: 2025-11-23
tags:
  - attack.execution
  - attack.t1059.004
logsource:
  category: process_creation
  product: linux
detection:
  selection:
    Image|endswith:
      - '/curl'
      - '/wget'
    CommandLine|contains:
      - '/tmp/'
      - '/dev/shm/'
  condition: selection
falsepositives:
  - Legitimate scripts
level: medium