title: Bash History Cleared
id: 598f57e1-5969-4a86-820b-0f526c10a560
tags:
  - attack.defense-evasion
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|contains:
      - 'history -c'
      - 'rm ~/.bash_history'
  condition: selection
level: medium
