title: Suspicious Regular Beaconing Pattern
id: 685790ea-b6c4-4795-9546-3ed9855e5a14
status: experimental
description: Detects processes making connections at regular intervals (±10%)
author: Christopher Bradford
date: 2025-11-23
tags:
  - attack.command-and-control
  - attack.t1071
logsource:
  category: firewall
  product: windows
detection:
  selection:
    DestinationPort: 443
  condition: selection
falsepositives:
  - Windows Update, Office 365, etc.
level: low