title: Suspicious SMB Beaconing (Lateral Movement)
id: c29f3721-2777-4060-b93b-3668886773c3
tags:
  - attack.lateral-movement
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    DestinationPort: 445
    Image|endswith:
      - '\svchost.exe'
      - '\lsass.exe'
  condition: selection
level: high
