title: Certutil Download Abuse
id: 23d6d6d6-6666-7777-8888-999999999999
status: stable
description: Certutil used to download files (LOLBIN)
author: Christopher Christopher Bradford
tags:
  - attack.t1105
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: '\certutil.exe'
    CommandLine|contains|all:
      - '-urlcache'
      - '-split'
      - '-f'
      - 'http'
  condition: selection
level: high
