title: Okta Brute Force or Credential Stuffing Attempt
id: 658bbfaa-9d0f-4c99-8bc5-c1b8a45232fb
status: stable
description: More than 10 failed logins followed by success from same IP
author: Christopher Bradford
date: 2025-11-23
tags:
  - attack.credential-access
  - attack.t1110
logsource:
  product: okta
  service: system
detection:
  selection:
    outcome.result: 'FAILURE'
    eventType: 'user.session.start'
  condition: selection
falsepositives:
  - User forgot password
level: medium