title: Event Log Service Stop or Clear Attempt
id: c7da061c-41c6-4974-87f7-e480ef49fd29
tags:
  - attack.defense-evasion
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    TargetObject|contains: '\SYSTEM\CurrentControlSet\Services\EventLog\'
    EventType: Delete
  condition: selection
level: critical
