title: AWS Suspicious New IAM User Creation
id: 84190cd4-46b0-4611-9d65-968a1d7131c1
status: experimental
description: New IAM user created from unusual IP/location
author: Christopher Bradford
date: 2025-11-23
tags:
  - attack.persistence
  - attack.t1136
logsource:
  product: aws
  service: cloudtrail
detection:
  selection:
    eventName: CreateUser
  condition: selection
falsepositives:
  - DevOps automation
level: medium