title: Cobalt Strike Beacon Process Creation
id: 06fc414e-0d0c-4671-a5e4-8afba54d8a17
status: stable
description: Detects typical Cobalt Strike named-pipe and process patterns
author: Christopher Bradford
date: 2025-11-23
tags:
  - attack.execution
  - attack.t1055
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: '\rundll32.exe'
    CommandLine|contains: 'post-ex'
  condition: selection
falsepositives:
  - None known
level: high