title: Heavily Obfuscated PowerShell
id: c9641f33-805d-471a-84f0-7225707ada01
tags:
  - attack.execution
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    CommandLine|re: '\^[a-zA-Z0-9+/=]{100,}'
  condition: selection
level: high
