title: Suspicious LNK File Creation in Startup/AppData
id: a4b44f20-09f3-49ba-9660-a75ba5d266ae
status: stable
description: LNK files created in startup folders or AppData
author: Christopher Bradford
date: 2025-11-23
tags:
  - attack.persistence
  - attack.t1547.001
logsource:
  category: file_event
  product: windows
detection:
  selection:
    TargetFilename|endswith: '.lnk'
    TargetFilename|contains:
      - '\Startup\'
      - '\AppData\Roaming\'
  condition: selection
falsepositives:
  - User-created shortcuts
level: medium