title: macOS Suspicious Python Network Connection
id: 53dbc5c5-abd7-4298-89ec-0799e2f2fd50
status: stable
description: Python making direct outbound connections (common in macOS malware)
author: Christopher Bradford
date: 2025-11-23
tags:
  - attack.command-and-control
logsource:
  category: process_creation
  product: macos
detection:
  selection:
    Image: '/usr/bin/python*'
    CommandLine|contains:
      - http://
      - https://
  condition: selection
falsepositives:
  - Python scripts with requests library
level: medium