title: Suspicious Inbox Rule Creation (Forward/Delete)
id: 32dd21e2-e47f-4fe3-b270-c6e1ba79a248
status: stable
description: Inbox rule that forwards or deletes mail
author: Christopher Bradford
date: 2025-11-23
tags:
  - attack.collection
  - attack.t1114.003
logsource:
  product: azure
  service: auditlogs
detection:
  selection:
    OperationName: 'New-InboxRule'
    Properties|contains: 'ForwardTo'
  condition: selection
falsepositives:
  - User-created forwarding
level: high